%% 初始化相关数据
A=20;%振幅
fs=44100;   %采样频率
N=8820;    % 信号样点数，每个音频播放时长
y = [];%用来存储音频数据
i_all = [];%用来记录每次i的值
f = [697,1209;697,1336;697,1477;770,1209;770,1336;770,1477;852 1209;852 1336;852 1477;941 1336];%从1-9-0的频率
stu_number = [3,2,1,0,1,0,3,1,4,4];%学号
%% 生成音频并播放
for j=1:10
    i = stu_number(j);
    i_all = [i_all i];
    k=i;
    if i == 0
        k=10;
    end
     y = [y A*sin(2*pi*f(k,1)*(0:N-1)/fs)+A*sin(2*pi*f(k,2)*(0:N-1)/fs) zeros(1,4410)];
end

audiowrite('学号音频文件.wav',y,fs);

disp(i_all);
sound(y,fs);